Repository: eliozo/qualification-project
Catalog: eliozoapp/eliozo/translations/*/LC_MESSAGES/messages.po
Languages: lt, lv

source: Books
lv: Mācību grāmatas

source: Back
lt: Atgal
lv: Atpakaļ

source: Concept
lt: Sąvoka
lv: Jēdziens

source: Usage
lv: Lietojums

source: Methods
lt: Metodai
lv: Metodes

source: Grade
lt: Klasė
lv: Klase

source: Remove Filter
lt: Nuimti filtrą
lv: Noņemt filtru

source: An olympiad problem usually belongs to some grade.
lt: Olimpiados uždavinys priklauso tam tikrai klasei.
lv: Olimpiādes uzdevums parasti domāts noteiktai klasei.

source: Problems in textbooks, contests or international olympiads are often suggested for multiple grades.
lt: Uždaviniai vadovėliuose, konkursuose ar tarptautinėse olimpiadose dažnai siūlomi kelioms klasėms.
lv: Uzdevumi grāmatās, konkursos vai starptautiskās olimpiādēs bieži ir piemēroti vairākām klasēm.

source: Source
lt: Šaltinis
lv: Avots

source: Regional or open olympiads cover fewer topics and require less preparation compared to others.
lt: Regioninės ar atviros olimpiados turi mažiau temų ir reikalauja mažiau pasiruošimo, palyginti su kitomis.
lv: Reģionu vai atklātās olimpiādes aptver mazāk tēmu un prasa mazāku sagatavotību, salīdzinot ar citām.

source: Contest problems could take longer as the time limit is several days.
lt: Konkurso problemoms gali prireikti daugiau laiko, nes terminas yra kelios dienos.
lv: Konkursu uzdevumi var aizņemt vairāk laika, jo risināšanai atvēlētas vairākas dienas.

source: A book is shown as source, if no other source is known.
lt: Vadovėlis rodomas kaip šaltinis, jei kitas šaltinis nežinomas.
lv: Grāmatu norāda kā avotu, ja cits avots nav zināms.

source: Domain
lt: Sritis
lv: Nozare

source: Every problem belongs to a domain
lt: Kiekviena problema turi sritį
lv: Katram uzdevumam ir nozare

source: Combinatorics
lt: Kombinatorika
lv: Kombinatorika

source: Geometry
lt: Geometrija
lv: Ģeometrija

source: Number theory
lt: Skaičių teorija
lv: Skaitļu teorija

source: Question
lt: Klausimas
lv: Jautājums

source: A question type implies the structure of a solution.
lt: Klausimo tipas nulemia sprendimo struktūrą.
lv: Jautājuma tips nosaka atrisinājuma struktūru.

source: Every subitem (A,B,...) may have its own question type.
lt: Kiekvienas poskyris (A,B,...) gali turėti savo klausimo tipą.
lv: Katram apakšpunktam (A,B,...) var būt savs jautājuma tips.

source: Find all solutions, show that there are no others.
lt: Raskite visus sprendimus, parodykite, kad kitų nėra.
lv: Atrast visus atrisinājumus, pamatot, ka citu nav.

source: Determine the count of answers or other objects.
lt: Nustatykite tik atsakymų ar kitų objektų skaičių.
lv: Noteikt atrisinājumu vai objektu skaitu.

source: Find the largest, the smallest or the "best" solution.
lt: Raskite didžiausią, mažiausią ar "geriausią" sprendimą.
lv: Atrast lielāko, mazāko vai "labāko" atrisinājumu.

source: Provide any example satisfying the requirements.
lt: Pateikite bet kokį pavyzdį, atitinkantį reikalavimus.
lv: Atrast kādu piemēru, kas apmierina prasības.

source: Prove the given statement.
lt: Įrodykite pateiktą teiginį.
lv: Pierādīt doto apgalvojumu.

source: Prove or disprove the given statement.
lt: Įrodykite arba paneigkite pateiktą teiginį.
lv: Pierādīt vai apgāzt doto apgalvojumu.

source: Describe a procedure, a construction, a game strategy.
lt: Parodykite procedūrą, konstrukciją, žaidimo strategiją.
lv: Atrast procedūru, konstrukciju vai spēles stratēģiju.

source: Enter an answer such as a number, a multiple choice or Yes/No.
lt: Įveskite atsakymą, pavyzdžiui, skaičių, pasirinktą alternatyvą arba Taip/Ne.
lv: Ierakstīt atbildi, piemēram, skaitli, izvēlēto alternatīvu vai Jā/Nē.

source: Method
lt: Metodas
lv: Metode

source: Method used in a solution.
lt: Viename iš sprendimų naudojamas metodas.
lv: Metode kas izmantota kādā no atrisinājumiem.

source: Unlike other metadata method is often unspecified.
lt: Skirtingai nuo kitų metaduomenų, metodas paprastai nenurodomas.
lv: Atšķirībā no citiem metadatiem metodi bieži nenorāda.

source: Solution
lt: Sprendimas
lv: Atrisinājums

source: Problems having at least one solution.
lt: Problemos su bent vienu sprendimu.
lv: Uzdevumi ar vismaz vienu atrisinājumu.

source: Problems with video-recorded solutions.
lt: Problemos su vaizdo sprendimais.
lv: Uzdevumi ar atrisinājumu video formā.

source: Search
lt: Ieškoti
lv: Meklēt

source: Pages
lt: Puslapiai
lv: Lapas

source: More
lt: Daugiau
lv: Vairāk

source: Home
lt: Pagrindinis
lv: Sākums

source: Filters
lt: Filtrai
lv: Filtri

source: Archive
lt: Archyvas
lv: Arhīvs

source: Order
lt: Rūšiuoti
lv: Kārtot

source: by Topic
lt: pagal temą
lv: pēc tēmas

source: by Method
lt: pagal metodą
lv: pēc metodes

source: by Genre
lt: pagal žanrą
lv: pēc žanra

source: by Concept
lt: pagal sąvoką
lv: pēc jēdziena

source: Reports
lt: Ataskaitos
lv: Pārskati

source: Olympiad Curriculum
lt: Olimpiadų apžvalga
lv: Olimpiāžu saturs

source: Problem Count
lt: Uždavinių skaičius
lv: Uzdevumu skaits

source: Property Usage
lt: Savybių naudojimas
lv: Atribūtu lietojums

source: Result Summary
lt: Rezultatai
lv: Rezultāti

source: About Us
lt: Apie mus
lv: Par mums

source: References
lt: Nuorodos
lv: Atsauces

source: Contact Information
lv: Kontaktinformācija

source: Exactly
lt: Tiksliai
lv: Precīzi

source: Regex
lt: Reg. išraiškos
lv: Reg. izteiksmi

source: By meaning
lt: Pagal reikšmę
lv: Pēc nozīmes

source: In questions
lt: Klausimuose
lv: Jautājumos

source: Everywhere
lt: Visur
lv: Visur

source: Topics
lt: Temos
lv: Tēmas

source: No solution
lt: Nėra sprendimo
lv: Nav atrisinājuma

source: Hide solution
lv: Noslēpt atrisinājumu

source: Problem Source
lt: Uždavinių šaltinis
lv: Uzdevumu avots

source: Entered
lt: Įvestos
lv: Ievadīti

source: Solved
lt: Išspręstos
lv: Atrisināti

source: Olympiad
lt: Olimpiada
lv: Olimpiāde

source: Metadata properties (problem classification types) and the number of problems using them.
lt: Metaduomenų savybės (uždavinių klasifikacijos tipai) ir uždavinių, kuriuose jos naudojamos, skaičius.
lv: Katram metadatu atribūtam (uzdevumu klasifikācijas veidam) norādīts uzdevumu skaits, kuros tas lietots.

source: The metadata properties are described
lt: Metaduomenų atributai aprašyti
lv: Metadatu atribūti aprakstīti

source: in the ontology
lt: ontologijoje
lv: ontoloģijā

source: Property Name
lt: Savybės pavadinimas
lv: Atribūta nosaukums

source: Olympiads
lt: Olimpiada
lv: Olimpiādes

source: Olympiad problems
lt: Olimpiadų uždaviniai
lv: Olimpiāžu uzdevumi

source: Take-home
lt: Konkursai
lv: Konkursi

source: Take-home contests and problem sets
lt: Konkursai ir uždavinių rinkiniai
lv: Konkursi un uzdevumu komplekti

source: Textbooks
lt: Vadovėliai
lv: Mācību grāmatas

source: Problems from textbooks
lt: Uždaviniai iš vadovėlių
lv: Uzdevumi no mācību grāmatām

source: Training
lt: Treniruotės
lv: Treniņuzdevumi

source: Training examples and miscellaneous
lt: Treniruočių uždaviniai ir kiti
lv: Treniņuzdevumi un citi

source: Number of metadata attribute values
lt: Metaduomenų atributų reikšmių skaičius
lv: Metadatu atribūtu vērtību skaits

source: Number of Values
lt: Atributų reikšmių skaičius
lv: Atribūtu vērtību skaits

source: Contact information
lt: Kontaktinė informacija
